HH_API_URL = 'https://api.hh.ru/vacancies'
SJ_API_URL = 'https://api.superjob.ru/2.0/vacancies/'
SJ_API_KEY = 'v3.r.137695416.0a834cab09168649ce71b4bb9afc6a5879e3e64d.7c882995003416062bf7505f66a50213e7bc5183'
SEARCH_RESULTS_FILE = 'search_results.json'
RESULTS_PER_PAGE = 2

MENU = {
    'level_1': {
        '1': 'HeadHunter',
        '2': 'SuperJob',
        '3': 'HeadHunter и SuperJob',
        '4': 'Новый запрос\n----------------------',
        '0': 'Выход из программы'
    },
    'level_2': {
        '1': 'Новый запрос',
        '2': 'Добавить запрос',
        '3': 'Фильтровать результаты',
        '4': 'Вывести результаты на экран',
        '5': 'Сохранить результаты в файл\n-------------------------------',
        '0': 'Выход из программы'
    },
    'Level_3': {
        '1': 'Сбросить фильтр',
        '2': 'Добавить фильтр',
        '8': 'Вывести результаты на экран',
        '9': 'Сохранить результаты в файл\n-------------------------------',
        '0': 'Выход из программы'
    }
}